export const branches = [
    { label: 'املاک', icon: '&', sebsetAdvertisements: [{ label: 'فروش مسکونی', subsetSubset: ['آپارتمان', "خانه و ویلا", "زمین وکلنگی"] }, { label: 'اجاره مسکونی', subsetSubset: ["آپارتمان", "خانه ویلا"] }, { label: 'فروش اداری وتجاری', subsetSubset: ["دفتر کار, اتاق اداری و مطب", "مغازه و غرفه", "صنعتی, کشاورزی و تجاری"] }, { label: 'اجاره اداری و تجاری', subsetSubset: ["دفتر کار, اتاق اداری و مطب", "مغازه و غرفه", "صنعتی, کشاورزی و تجاری"] }, { label: 'اجاره کوتاه مدت', subsetSubset: ["آپارتمان و سوئیت", "ویلا و باغ", "دفتر کار و فضای آموزشی"] }, { label: 'پروژه های ساخت ساز', subsetSubset: ["مشارکت در ساخت", "پیش فروش"] }] },
    { label: 'وسایل نقلیه', icon: '&', sebsetAdvertisements: [{ label: 'خودرو', subsetSubset: ["سواری و وانت", "کلاسیک", "اجاره ای", "سنگین"] }, { label: 'موتور سیکلت', subsetSubset: false }, { label: 'قطعات یدکی و لوازم جانبی', subsetSubset: false }, { label: 'قایق وسایر وسایل نقلیه', subsetSubset: false },] },
    { label: 'کالای دیجیتال', icon: '&', sebsetAdvertisements: [{ label: 'موبایل وتبلت', subsetSubset: ["موبایل", "تبلت", "لئازم جانبی موبایل و تبلت", "سیم کارت"] }, { label: 'رایانه', subsetSubset: ["رایانه همراه", "رایانه رومیزی", "قطعات و لوازم جانبی", "مودم و تجهیزات شبکه", "پرینتر/اسکنر/کپی/فکس"] }, { label: 'کنسول, بازی ویدئویی وآنلاین', subsetSubset: false }, { label: 'صوتی و تصویری', subsetSubset: ["فیلم و موسیقی", "دوربین عکاسی و فیلم برداری", "پخش کننده همراه", "سیستم صوتی خانگی", "ویدئو و پخش کننده DVD", "تلوزیون و پروژکتور", "دوربین مداربسته"] }, { label: 'تلفن رومیزی', subsetSubset: false },] },
    { label: 'خانه و آشپزخانه', icon: '&', sebsetAdvertisements: [{ label: 'لوازم خانگی برقی', subsetSubset: ["یخچال و فریزر", "آب سرد کن و تصفیه آب", "ماشین لباسشویی و خشک کن لباس", "ماشین ظرفشویی", "جاروبرقی, جاروشارژی و بخارشو", "اتو و لوازم اتو", "آبمیوه و آب مرکبات گیر", "خردکن, آسیاب و غذاساز", "سماور, چای ساز و قهوه ساز", "اجاق گاز و لوازم برقی پخت و پز", "هود", "سایر لوازم برقی"] }, { label: 'ظروف و لوازم آشپزخانه', subsetSubset: ["سفره, حوله و دستمال آشپزخانه", "آب چکان و نظم دهنده ظروف", "قوری, کتری و قهوه ساز دستی", "ظروف سرو و پذیرایی", "ظروف نگهدارنده, پلاستیکی و یکبارمصرف", "ظروف پخت و پز"] }, { label: 'خوردنی و آشامیدنی و خیاطی و بافتنی', subsetSubset: false }, { label: 'مبلمان وصنایع چوب', subsetSubset: ["چرخ خیاطی و ریسندگی", "لوازم خیاطی و بافتنی"] }, { label: 'نور و روشنایی', subsetSubset: ["مبلمان خانگی و میزعسلی", "میز و صندلی غذاخوری", "بوفه, ویترین و کنسول", "کتابخانه, شلف و قفسه های دیواری", "جاکفشی, کمد دیواری", "تخت و سرویس خواب", "میز تلفن", "میز تلوزیون", "میز تحریر و کامپیوتر", "مبلمان اداری", "صندلی و نیمکت"] }, { label: 'فرش, گلیم و موکت', subsetSubset: ["لوستر و چراغ آویز", "چراغ خواب و آباژور", "ریسه و چراغ تزئینی", "لامپ و چراغ"] }, { label: 'تشک, روتختی و رختخواب', subsetSubset: ["فرش", "تابلو فرش", "روفرشی", "پادری", "موکت", "گلیم, جاجیم و گبه", "پشتی"] }, { label: 'لوازم دکوری و تزئینی', subsetSubset: ["رختخواب, بالش و پتو", "تشک تختخواب", "سرویس روتختی"] }, { label: 'تهویه, سرمایش و گرمایش', subsetSubset: ["پرده, رانر و رومیزی", "آینه", "ساعت دیواری و تزئینی", "تابلو, نقاشی و عکس", "مجسمه, تندیس و ماکت", "گل مصنوعی", "گل و گیاه طبیعی", "صنایع دستی و سایر لوازم تزئینی"] }, { label: 'شست و شو و نظافت', subsetSubset: ["آبگرمکن, پکیج و شوفاژ", "بخاری, هیتر و شومینه", "کولر آبی", "کولر گازی و فن کوئل", "پنکه و تصفیه کننده هوا"] }, { label: 'حمام وسریس بهداشتی', subsetSubset: ["لوازم حمام", "لوازم سرویس بهداشتی"] },] },
    { label: 'خدمات', icon: '&', sebsetAdvertisements: [{ label: 'موتور و ماشین', subsetSubset: false }, { label: 'پذیرایی/مراسم', subsetSubset: false }, { label: 'خدمات رایانه ای موبایل', subsetSubset: false }, { label: 'مالی/حسابداری/بیمه', subsetSubset: false }, { label: 'حمل و نقل', subsetSubset: false }, { label: 'پیشه و مهارت', subsetSubset: false }, { label: 'آرایشگری و زیبایی', subsetSubset: false }, { label: 'سرگرمی', subsetSubset: false }, { label: 'نظافت', subsetSubset: false }, { label: 'باغبانی و درختکاری', subsetSubset: false }, { label: 'آموزشی', subsetSubset: false },] },
    { label: 'وسایل شخصی', icon: '&', sebsetAdvertisements: [{ label: 'کیف, کفش و لباس', subsetSubset: ["کیف/کفش/کمربند", "لباس"] }, { label: 'زیورآلات و اکسسوری', subsetSubset: ["ساعت", "جواهرات", "بدلیجات"] }, { label: 'آرایشی, بهداشتی و درمانی', subsetSubset: false }, { label: 'کفش و لباس بچه', subsetSubset: false }, { label: 'وسایل بچه و اسباب بازی', subsetSubset: ["اسباب بازی", "کالسکه و لوازم جانبی", "صندلی بچه", "اسباب واثاث بچه"] }, { label: 'لوازم التحریر', subsetSubset: false },] },
    { label: 'سرگرمی و فراغت', icon: '&', sebsetAdvertisements: [{ label: 'بلیط', subsetSubset: ["کنسرت", "تئاتر و سینما", "کارت هدیه و تخفیف", "اماکن و مسابقات ورزشی", "ورزشی", "اتوبوس, مترو و قطار"] }, { label: 'تور و چارتر', subsetSubset: false }, { label: 'کتاب و مجله', subsetSubset: ["آموزشی", "ادبی", "تاریخی", "مذهبی", "مجلات"] }, { label: 'دوچرخه/اسکیت/اسکوتر', subsetSubset: false }, { label: 'حیوانات', subsetSubset: ["گربه", "موش و خرگوش", "خزنده", "پرنده", "ماهی", "لوازم جانبی", "حیوانات مزرعه", "سگ"] }, { label: 'کلکسیون و سرگرمی', subsetSubset: ["سکه, تمبر و اسکناس", "اشیای عتیقه"] }, { label: 'آلات موسیقی', subsetSubset: ["گیتار, بیس و امپلیفایر", "سازهای بادی", "پیانو/کیبورد/آکاردئون", "سنتی", "درام و پرکاشن", "ویولن"] }, { label: 'ورزش و تناسب اندام', subsetSubset: ["ورزش های توپی", "کوهنوردی و کمپینگ", "غواصی و ورزش های آبی", "ماهیگیری", "تجهیزات ورزشی", "ورزش های زمستانی", "اسب و تجهیزات اسب سواری"] }, { label: 'اسباب بازی', subsetSubset: false },] },
    { label: 'اجتماعی', icon: '&', sebsetAdvertisements: [{ label: 'رویداد', subsetSubset: ["حراج", "گردهمایی و همایش", "ورزشی"] }, { label: 'داوطبانه', subsetSubset: ["تحقیقاتی"] }, { label: 'گم شده', subsetSubset: ["حیوانات", "اشیا"] },] },
    { label: 'تجهیزات و صنعتی', icon: '&', sebsetAdvertisements: [{ label: 'مصالح و تجهیزات ساختمان', subsetSubset: false }, { label: 'ابزارآلات', subsetSubset: false }, { label: 'ماشین آلات صنعتی', subsetSubset: false }, { label: 'تجهیزات کسب و کار', subsetSubset: ["پزشکی", "فروشگاه و مغازه", "کافی شاپ و رستوران", "آرایشگاه و سالن های زیبایی", "دفتر کار"] }, { label: 'عمده فروشی', subsetSubset: false },] },
    { label: 'استخدام و کاریابی', icon: '&', sebsetAdvertisements: [{ label: 'اداری و مدیریت', subsetSubset: false }, { label: 'سرایداری و نظافت', subsetSubset: false }, { label: 'معماری, عمران و ساختمانی', subsetSubset: false }, { label: 'خدمات فروشگاه و رستوران', subsetSubset: false }, { label: 'رایانه و فناوری اطلاعات', subsetSubset: false }, { label: 'مالی و حسابداری و حقوقی', subsetSubset: false }, { label: 'بازاریابی و فروش', subsetSubset: false }, { label: 'صنعتی و فنی و مهندسی', subsetSubset: false }, { label: 'آموزشی', subsetSubset: false }, { label: 'حمل و نقل', subsetSubset: false }, { label: 'درمانی و زیبایی و بهداشتی', subsetSubset: false }, { label: 'هنری و رسانه', subsetSubset: false },] },
];
export const advertisements = [
    {
        id: 1,
        mainImageSrc: '',
        mainBranche: 'کالای دیجیتال',
        branche: 'موبایل',
        image: ['asdasd', 'asdasdasd', 'asdasd'],
        title: 'موبایل',
        description: 'با سلام موبایل عالی است',
        location: 'نیشابور',
        price: 15000000,
        specification: [
            { title: 'وضعیت', value: 'نو' },
            { title: 'اصالت برند', value: 'اصل' },
            { title: 'تعداد سیم کارت', value: '2 عدد' },
            { title: 'حافظه داخلی', value: '256 گیگابایت' },
            { title: 'مقدار رم', value: '8 گیگابایت' },
            { title: 'قیمت', value: 150000000 },
        ]
    },
    {
        id: 2,
        mainImageSrc: '',
        mainBranche: 'کالای دیجیتال',
        branche: 'موبایل',
        image: ['asdasd', 'asdasdasd', 'asdasd'],
        title: 'موبایل',
        description: 'با سلام موبایل عالی است',
        location: 'نیشابور',
        price: 15000000,
        specification: [
            { title: 'وضعیت', value: 'نو' },
            { title: 'اصالت برند', value: 'اصل' },
            { title: 'تعداد سیم کارت', value: '2 عدد' },
            { title: 'حافظه داخلی', value: '256 گیگابایت' },
            { title: 'مقدار رم', value: '8 گیگابایت' },
            { title: 'قیمت', value: 150000000 },
        ]
    },
    {
        id: 3,
        mainImageSrc: '',
        mainBranche: 'کالای دیجیتال',
        branche: 'موبایل',
        image: ['asdasd', 'asdasdasd', 'asdasd'],
        title: 'موبایل',
        description: 'با سلام موبایل عالی است',
        location: 'نیشابور',
        price: 15000000,
        specification: [
            { title: 'وضعیت', value: 'نو' },
            { title: 'اصالت برند', value: 'اصل' },
            { title: 'تعداد سیم کارت', value: '2 عدد' },
            { title: 'حافظه داخلی', value: '256 گیگابایت' },
            { title: 'مقدار رم', value: '8 گیگابایت' },
            { title: 'قیمت', value: 150000000 },
        ]
    },
    {
        id: 4,
        mainImageSrc: '',
        mainBranche: 'کالای دیجیتال',
        branche: 'موبایل',
        image: ['asdasd', 'asdasdasd', 'asdasd'],
        title: 'موبایل',
        description: 'با سلام موبایل عالی است',
        location: 'نیشابور',
        price: 15000000,
        specification: [
            { title: 'وضعیت', value: 'نو' },
            { title: 'اصالت برند', value: 'اصل' },
            { title: 'تعداد سیم کارت', value: '2 عدد' },
            { title: 'حافظه داخلی', value: '256 گیگابایت' },
            { title: 'مقدار رم', value: '8 گیگابایت' },
            { title: 'قیمت', value: 150000000 },
        ]
    },
    {
        id: 5,
        mainImageSrc: '',
        mainBranche: 'وسایل نقلیه',
        branche: 'موتور سیکلت',
        image: ['asdasd', 'asdasdasd', 'asdasd'],
        title: 'موتور',
        description: 'با سلام موبایل عالی است',
        location: 'نیشابور',
    price: 15000000,
        specification: [
            { title: '', value: '' },
        ]
    },
    {
        id: 6,
        mainImageSrc: '',
        mainBranche: 'وسایل نقلیه',
        branche: 'موتور سیکلت',
        image: ['asdasd', 'asdasdasd', 'asdasd'],
        title: 'موتور',
        description: 'با سلام موبایل عالی است',
        location: 'نیشابور',
    price: 15000000,
        specification: [
            { title: '', value: '' },
        ]
    },
];
export const dataBaseCity = [
    { id: 0, city: 'آذربایجان شرقی', subCity: ["آذر شهر", "اهر", "بناب", "تبریز", "سراب", "سهند", "مراغه", "مرند", "میانه"] },
    { id: 1, city: 'آذربایجان غربی', subCity: ["ارومیه", "اشنویه", "بوکان", "پیرانشهر", "خوی", "سردشت", "سلماس", "شاهین دژ", "ماکو", "مهاباد", "میاندوآب", "نقده"] },
    { id: 2, city: 'اردبیل', subCity: ["اردبیل", "پارس آباد", "خلخال", "سرعین", "گرمی", "مشکین شهر", "نمین"] },
    { id: 3, city: 'اصفهان', subCity: ["آران و بیدگل", "ابریشم", "اصفهان", "خمینی شهر", "خوانسار", "خور", "داران", "داران", "سمیر", "شاهین شهر", "فلاورجان", "قمصر", "کاشان", "گلپایگان", "لنجان", "مبارکه", "نجف آباد"] },
    { id: 4, city: 'البرز', subCity: ["آسارا", "اشتهارد", "تنکمان", "چهارباغ", "طالقان", "فردیس", "کرج", "کوهسار", "گرمدره", "ماهدشت", "محمدشهر", "نظرآباد", "هشگرد"] },
    { id: 5, city: 'ایلام', subCity: ["آبادان", "ایلام", "ایوان", "دهلران", "مهران"] },
    { id: 6, city: 'بوشهر', subCity: ["برازجان", "بندر دیر", "بندر کنگان", "بندر گناوه", "بوشهر", "جم", "خورموج"] },
    { id: 7, city: 'تهران', subCity: ["آبسرد", "آبعلی", "ارجمند", "اسلامشهر", "اندیشه", "باقرشهر", "بومهن", "پاکدشت", "پردیس", "پرند", "پیشوا", "تهران", "جوادآباد", "چهاردانگه", "دماوند", "رباط کریم", "رودهن", "ری", "شاهدشهر", "شمشک", "شهریاز", "صباشهر", "صفادشهر", "فردوسیه", "فشم", "فیروزکوه", "قدس", "قرچک", "کهریزک", "گیلان", "گلستان", "لواسان", "نسیم شهر", "وحیدیه", "ورامین"] },
    { id: 8, city: 'چهارمحال و بختیاری', subCity: ["بروجن", "سامان", "شهرکرد", "فرخ شهر", "لردگان"] },
    { id: 9, city: 'خراسان جنوبی', subCity: ["بیرجند", "طبس", "فردوس", "قاین"] },
    { id: 10, city: 'خراسان رضوی', subCity: ["بردسکن", "تایباد", "تربت جام", "تربت حیدری", "چناران", "خواف", "سبزوار", "شاندیز", "طرقبه", "قاسم آباد(خواف)", "قوچان", "گلبهار", "گناباد", "مشهد", "ملک آباد", "نیشابوز"] },
    { id: 11, city: 'خراسان شمالی', subCity: ["آشخانه", "اسفراین", "بجنورد", "شیروان"] },
    { id: 12, city: 'خوزستان', subCity: ["آبادان", "امیدیه", "اندیمشک", "اهواز", "ایذه", "بندر امام خمینی", "بندر ماهشهر", "بهبهان", "چمران", "حمیدیه", "خرمشهر", "دزفول", "رامشهر", "رامهرمز", "سوسنگرد", "شادگان", "شوش", "شوشتر", "مسجد سلیمان", "هندیجان"] },
    { id: 13, city: 'زنجان', subCity: ["ابهر", "خرمدره", "زنجان", "قیدار"] },
    { id: 14, city: 'سمنان', subCity: ["دامغان", "سمنان", "شاهرود", "گرمسار"] },
    { id: 15, city: 'سیستان و بلوچستان', subCity: ["ایرانشهر", "چابهار", "خاش", "زابل", "زاهدان", "زهک", "سروان-سیستان و بلوچستان", "کنارک"] },
    { id: 16, city: 'فارس', subCity: ["آباده", "اقلید", "جهرم", "خور", "داراب", "زرقان", "شیراز", "صدرا-فارس", "فسا", "فیروز آباد", "کازرون", "لار", "لامرد", "مرودشت", "مهر", "نورآباد ممسنی", "نی ریز"] },
    { id: 17, city: 'قزوین', subCity: ["آبیک", "اقبایله", "الوند", "تاکستان", "شال", "قزوین", "محمدیه-قزوین"] },
    { id: 18, city: 'قم', subCity: ["قم"] },
    { id: 19, city: 'کردستان', subCity: ["بانه", "بیجار", "دهگلان", "سقز", "سنندج", "قروه", "کامیاران", "مریوان"] },
    { id: 20, city: 'کرمان', subCity: ["بافت", "بردسیر", "بلوک", "بم", "جیرفت", "رفسنجان", "زرند", "سیرجان", "کرمان", "کهنوج", "ماهان"] },
    { id: 21, city: 'کرمانشاه', subCity: ["اسلام آباد غرب", "بیستون", "جوانرود", "سرپل ذهاب", "سنقز", "صحنه", "کرمانشاه", "کنگار", "گهواره", "هرسین"] },
    { id: 22, city: 'کهگیلویه و بویراحمد', subCity: ["دوگنبدان", "دهدشت", "سی سخت", "یاسوج"] },
    { id: 23, city: 'گلستان', subCity: ["آزادشهر", "آق قلا", "بندر ترکمن", "علی آباد کتول", "کردکوی", "کلاله", "گالیکش", "گرگان", "گمیشان", "گنبد کاووس", "مینودشت"] },
    { id: 24, city: 'گیلان', subCity: ["آستارا", "آستانه اشرفیه", "احمدسرگوراب", "اسالم", "املش", "بره سر", "بندر انزلی", "پره سر", "تالش", "توتکابن", "جیرنده", "چابکسر", "چاف و چمخاله", "چوبر", "حویق", "خشکبیجار", "خمام", "دیلمان", "رانکوه", "رحیم آباد", "رستم آباد", "رشت", "رضوانشهر", "رودبار", "رودبنه", "رودسر", "زیباکنار", "سنگر", "سیاهکل", "شفت", "شلمان", "صومعه سرا", "فومن", "کلا چای", "کوچصفهان", "کومله", "کیاشهر", "گوراب زرمیخ", "لاهیجان", "لشت نشا", "لنگرود", "لوشان", "لولمان", "لوندویل", "لیسار", "ماسال", "ماسوله", "ماکلوان", "منجیل"] },
    { id: 25, city: 'لرستان', subCity: ["ازنا", "الشتر", "الیگودرز", "بروجرد", "پلدختر", "خرم آباد", "دورود", "کوهدشت", "نورآباد"] },
    { id: 26, city: 'مازندران', subCity: ["آلاشت", "آمل", "امیرکلا", "ایزدشهر", "بابل", "بابلسر", "بلده", "بهشهر", "بهنمیر", "پل سفید", "تنکابن", "جویبار", "چالوس", "چمستان", "خلیل شهر", "خوش رودپی", "رامسر", "رستمکلا", "رویان", "رینه", "زیرآب", "ساری", "سرخرود", "سلمان شهر", "سورک", "شیر گاه", "عباس آباد", "فرخ آباد", "فریدون کنار", "فریم", "قائم شهر", "کتالم و سادات شهر", "کلار آباد", "کلاردشت", "کوهی خیل", "کیاسر", "کیاکلا", "کتاب", "گزنک", "گلوگاه", "محمود آباد", "مرزن آباد", "مرزیکلا", "نشتاورد", "نکا", "نور", "نوشهر"] },
    { id: 27, city: 'مرکزی', subCity: ["اراک", "خمین", "دلیجان", "ساوه", "شازند", "محلات", "مهاجران"] },
    { id: 28, city: 'هرمزگان', subCity: ["بندرعباس", "تخت", "درگهان", "قشم", "کیش", "میناب", "هرمز"] },
    { id: 29, city: 'همدان', subCity: ["اسدآباد", "بهار", "تویسرکان", "کبودراهنگ", "ملایر", "نهاوند", "همدان"] },
    { id: 30, city: 'یزد', subCity: ["اردکان", "بافق", "تفت", "حمیدیا", "مهریز", "میبد", "یزد"] },
];
export const specifications = [
    // 1
    {
        branche: 'آپارتمان', arr: [
            { title: 'مشخصات کلی', property: [0, 1] },
            { title: 'ویژگی ها', property: [2, 4, 5, 6, 7, 8] },
            { title: 'امکانات', property: [10, 11, 12, 13] },
        ],
        isShowImage: true,
    },
    {
        branche: 'خانه و ویلا', arr: [
            { title: 'مشخصات کلی', property: [0, 1] },
            { title: 'ویژگی ها', property: [13, 14, 4, 5, 6, 7] },
            { title: 'امکانات', property: [10, 11, 12, 13] },
        ],
        isShowImage: true,
    },
    {
        branche: 'زمین و گلنگی', arr: [
            { title: 'مشخصات کلی', property: [0, 1] },
            { title: 'ویژگی ها', property: [2, 15,] },
        ],
        isShowImage: true,
    },
    {
        branche: 'دفتر کار, اتاق اداری و مطب', arr: [
            { title: 'مشخصات کلی', property: [0, 1] },
            { title: 'ویژگی ها', property: [2, 15, 6, 7, 8,] },
            { title: 'امکانات', property: [16, 9, 10, 11,] },
        ],
        isShowImage: true,
    },
    {
        branche: 'مغازه غرفه', arr: [
            { title: 'مشخصات کلی', property: [0, 1] },
            { title: 'ویژگی ها', property: [2, 15, 6, 7, 16] },
        ],
        isShowImage: true,
    },
    {
        branche: 'صنعتی, کشاورزی و تچاری', arr: [
            { title: 'مشخصات کلی', property: [0, 1] },
            { title: 'ویژگی ها', property: [2, 15, 6, 7, 16] },
        ],
        isShowImage: true,
    },
    {
        branche: 'آپارتمان و سوئیت', arr: [
            { title: 'مشخصات کلی', property: [0, 1] },
            { title: 'ویژگی ها ملک', property: [2, 6] },
            { title: 'شرایط اجاره', property: [17, 3] },
        ],
        isShowImage: true,
    },
    {
        branche: 'ویلا و باغ', arr: [
            { title: 'مشخصات کلی', property: [0, 1] },
            { title: 'ویژگی ها ملک', property: [2, 6] },
            { title: 'شرایط اجاره', property: [17, 3] },
        ],
        isShowImage: true,
    },
    {
        branche: 'رفتر کار و فضای آموزشی', arr: [
            { title: 'مشخصات کلی', property: [0, 1] },
            { title: 'ویژگی ها ملک', property: [2, 6] },
            { title: 'شرایط اجاره', property: [17, 3] },
        ],
        isShowImage: true,
    },
    {
        branche: 'مشارکت در ساخت', arr: [
            { title: 'مشخصات کلی', property: [0, 1] },
            // { title: 'ویژگی ها', property: [] },
        ],
        isShowImage: true,
    },
    {
        branche: 'پیش فروش', arr: [
            { title: 'مشخصات کلی', property: [0, 1] },
            // { title: 'ویژگی ها', property: [] },
        ],
        isShowImage: true,
    },
    // 2
    {
        branche: 'سواری و وانت', arr: [
            { title: 'اطلاعات الزامی', property: [0, 2, 3, 4, 5, 6] },
            { title: 'اطلاعات تکمیلی', property: [7, 9, 10, 11] },
            // !!!!!!!!!!!@@@@@@@@@ text
        ],
        isShowImage: true,
    },
    {
        branche: 'اجاره ای', arr: [
            { title: 'مشخصات کلی', property: [12] },
            { title: 'ویژگی ها', property: [13, 11] },
        ],
        isShowImage: true,
    },
    {
        branche: 'کلاسیک', arr: [
            // { title: 'مشخصات کلی', property: [0, 1] },
            { title: 'ویژگی ها', property: [13, 12] },
        ],
        isShowImage: true,
    },
    {
        branche: 'سنگین', arr: [
            // { title: 'مشخصات کلی', property: [] },
            { title: 'ویژگی ها', property: [14, 4, 13, 11] },
        ],
        isShowImage: true,
    },
    {
        branche: 'موتور سیکلت', arr: [
            // { title: 'مشخصات کلی', property: [] },
            { title: 'ویژگی ها', property: [1, 14, 4, 13, 11] },
        ],
        isShowImage: true,
    },
    {
        branche: 'قطعات یدکی و لوازم جانبی', arr: [
            // { title: 'مشخصات کلی', property: [0, 1] },
            { title: 'ویژگی ها', property: [13, 11] },
        ],
        isShowImage: true,
    },
    {
        branche: 'قایق و سایر وسایل نقلیه', arr: [
            // { title: 'مشخصات کلی', property: [] },
            { title: 'ویژگی ها', property: [13, 11] },
        ],
        isShowImage: true,
    },
    // 3
    {
        branche: 'موبایل', arr: [
            // { title: 'ویژگی ها', property: [] },
            { title: 'اطلاعات الزامی', property: [0, 1, 2, 3] },
            { title: 'اطلاعات تکمیلی', property: [4, 5, 6, 8, 9, 7] },
        ],
        isShowImage: true,
    },
    {
        branche: 'تبلت', arr: [
            // { title: 'مشخصات کلی', property: [] },
            { title: 'ویژگی ها', property: [10, 11] },
            { title: 'اطلاعات تکمیلی', property: [12, 13, 4, 5, 14, 1, 6, 7, 8] },
        ],
        isShowImage: true,
    },
    // { title: 'برند و مدل', value: '' }, // 0
    // { title: 'وضعیت', value: '' }, // 1
    // { title: 'تعداد سیم کارت', value: '' }, // 2
    // { title: 'اصالت برند', value: '' }, // 3
    // { title: 'حافظه داخلی', value: '' }, // 4
    // { title: 'مقدار رم', value: '' }, // 5
    // { title: 'قیمت', value: '' }, // 6
    // { title: 'مایلم معاوضه کنم', value: 'checkbox' }, // 7
    // { title: 'قیمت مقطوع است', value: 'checkbox' }, // 8
    // { title: 'امکان فروش به صورت قسطی هم وجود دارد.', value: 'checkbox' }, // 9
    // { title: 'سازنده', value: '' }, // 10
    // { title: 'پشتیبانی از کارت', value: 'checkbox' }, // 11
    // { title: 'اندازه صحفه', value: '' }, // 12
    // { title: 'سیستم عامل', value: '' }, // 13
    // { title: 'رنگ', value: '' }, // 14
    // { title: 'نوع سیم کارت', value: '' }, // 15
    // { title: 'پردازنده', value: '' }, // 16
    // { title: 'صفحه لمسی', value: '' }, // 17
    // { title: 'پورت HDMI', value: '' }, // 18
    // { title: 'نوع کالا', value: '' }, // 19

    // {branche:'',arr:[]},
    // {branche:'',arr:[]},
    // {branche:'',arr:[]},
    // { title: '', property: [] },
];

export let adsad = [
    // { title: 'دسته بندی', value: 'املاک' },
    // 1
    [
        { title: 'محدوده ملک', value: 'نیشابور' }, // 0
        { title: 'آگهی دهنده', value: 'شخصی' }, // 1
        { title: 'متراژ', value: '' }, // 2
        { title: 'اجاره', value: '' }, // 3
        { title: 'ودیعه و اجاره', value: '' }, // 4
        { title: 'مناسب برای', value: '' }, // 5
        { title: 'تعداد اتاق', value: '' }, // 6
        // !
        { title: 'سال ساخت', value: '' }, // 7
        // !
        { title: 'طبقه', value: '' }, // 8
        { title: 'آسانسور', value: '' }, // 9
        { title: 'پارکینگ', value: '' }, // 10
        { title: 'انباری', value: '' }, // 11
        { title: 'سایر ویژگی ها و امکانات', value: [] }, // 12
        { title: 'متراژ زمین', value: '' }, // 13
        { title: 'متراژ بنا', value: '' }, // 14
        { title: 'قیمت کل', value: '' }, // 15
        { title: 'سند اداری', value: 'chackbox' }, // 16
        { title: 'حداکثر ظرفیت', value: '' }, // 17
        { title: 'بالکن', value: '' }, // 18
    ],
    // 2
    // { title: 'محدوده آگهی', value: '' },
    [
        { title: 'برند و تیپ', value: '' }, // 0
        { title: 'برند', value: '' }, // 1
        { title: 'مدل (سال تولید)', value: '' }, // 2
        // !
        { title: 'رنگ', value: '' }, // 3
        // !
        { title: 'کارکرد', value: '' }, // 4
        { title: 'وضعیت شاسی و بدنه', value: '' }, // 5
        { title: 'قیمت پایه', value: '' }, // 6
        { title: 'وضعیت موتور', value: '' }, // 7
        { title: 'قیمت فروش نقدی', value: '' }, // 8
        { title: 'مهلت بیمه شخس ثالث', value: '' }, // 9
        { title: 'گیربکس', value: '' }, // 10
        { title: 'مایلم معاوضه کنم', value: 'checkbox' }, // 11
        { title: 'نوع آگهی', value: '' }, // 12
        // !
        { title: 'قیمت', value: '' }, // 13
        // !
        // !
        { title: 'سال ساخت', value: '' }, // 14
        // !
    ],
    // 3
    // ?????????????????????????????
    [
        { title: 'برند و مدل', value: '' },
        { title: 'وضعیت', value: '' },
        { title: 'تعداد سیم کارت', value: '' },
        { title: 'اصالت برند', value: '' },
        { title: 'حافظه داخلی', value: '' },
        { title: 'مقدار رم', value: '' },
        // !
        { title: 'قیمت', value: '' },
        // !
        { title: 'مایلم معاوضه کنم', value: 'checkbox' },
        { title: 'قیمت مقطوع است', value: 'checkbox' },
        { title: 'امکان فروش به صورت قسطی هم وجود دارد.', value: 'checkbox' },
        { title: 'سازنده', value: '' },
        { title: 'پشتیبانی از کارت', value: 'checkbox' },
        { title: 'اندازه صحفه', value: '' },
        { title: 'سیستم عامل', value: '' },
        // !
        { title: 'رنگ', value: '' },
        // !
        { title: 'نوع سیم کارت', value: '' },
        { title: 'پردازنده', value: '' },
        { title: 'صفحه لمسی', value: '' },
        { title: 'پورت HDMI', value: '' },
        { title: 'نوع کالا', value: '' },
    ],
    // 4
    [
        { title: 'سازنده', value: '' },
        { title: 'وضعیت', value: '' },
        // !
        { title: 'قیمت', value: '' },
        // !
        { title: 'مایلم معاوضه کنم', value: 'checkbox' },
        { title: 'قیمت مقطوع است', value: 'checkbox' },
        { title: 'ظرفیت', value: '' }
    ],
    // 5
    [
        { title: 'لینک وب سایت', value: '' },
    ],
    // 6
    [
        { title: 'نوع کالا', value: '' },
        { title: 'زنانه/مردانه', value: '' },
        { title: 'دارای ضمانت', value: '' },
        { title: 'در رنگ و طرح متنوع', value: '' },
        { title: 'تولید کننده', value: '' },
        { title: 'وضغیت', value: '' },
        // !
        { title: 'قیمت', value: '' },
        // !
        { title: 'مایلم معاوضه کنم', value: 'checkbox' },
        { title: 'قیمت مقطوع است', value: 'checkbox' },
        { title: 'نوع ساعت', value: '' },
        { title: '', value: '' },
        { title: '', value: '' },
    ],
    // 7
    [
        { title: '', value: '' },
        { title: '', value: '' },
    ]
];
// { title: '', value: '' },